<a href="https://colab.research.google.com/github/Oguzaltiner/deneme/blob/master/pandas.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

#Kütüphaneler
GEREKLİ KÜTÜPHANELER EKLENDİ.

In [0]:
import numpy as np 
import pandas as pd
from numpy.random import randn

#SERİ OLUŞTURMA

In [3]:

Label_list = ['I','am','Learning','Data','Science' ]
Data_list = [1,2,3,4,5]
Pd_Series1 = pd.Series(Data_list,Label_list)
print(Pd_Series1)

I           1
am          2
Learning    3
Data        4
Science     5
dtype: int64

In [0]:
data  = np.array(['a','b','c','d'])
Series  = pd.Series(data,[100,101,102,103])

In [0]:
DataDict = {'Michael_s exam result': 35,'Olivia_s exam result': 85 }
A=pd.Series(DataDict)
print(A)

Michael_s exam result    35
Olivia_s exam result     85
dtype: int64

In [0]:
DataDict2 = {'Michael_s exam result': 44}
B = pd.Series(DataDict2)
print(B)

Michael_s exam result    44
dtype: int64

In [0]:
DataDict3 = {'Darth_Vader_s exam result' :99}
C = pd.Series(DataDict3)
print(C)

Darth_Vader_s exam result    99
dtype: int64

C Değerine A değerini ekledik .

In [0]:
DataDict4 = C.append(A)

#DataFrame oluşturma

In [0]:

df = pd.DataFrame(data=randn(5,5), index= ['A','B','C','D','E'], columns =['C1','C2','C3','C4','C5'])

In [7]:
print(df)

         C1        C2        C3        C4        C5
A -0.675654  0.218769  1.988181  0.821131  0.506288
B -0.200131  0.201463  0.696673  2.715557  0.788112
C -0.355683 -0.051583  0.313034  0.466823 -1.144892
D  0.383685  0.177036  0.203438  0.622645  0.602650
E  0.073979  0.691840 -0.166630  0.984064 -0.875025

#İSTENİLEN SÜTÜNU ALMA

In [8]:
print(df['C1'])

A   -0.675654
B   -0.200131
C   -0.355683
D    0.383685
E    0.073979
Name: C1, dtype: float64

#YENİ BİR SÜTUN EKLEME İŞLEMİ

In [9]:

df['C6']=pd.Series(randn(5),['A','B','C','D','E'])
print(df['C6'])

A   -2.673562
B    0.050123
C   -0.250105
D   -1.053001
E   -0.496758
Name: C6, dtype: float64

In [10]:
print(df)

         C1        C2        C3        C4        C5        C6
A -0.675654  0.218769  1.988181  0.821131  0.506288 -2.673562
B -0.200131  0.201463  0.696673  2.715557  0.788112  0.050123
C -0.355683 -0.051583  0.313034  0.466823 -1.144892 -0.250105
D  0.383685  0.177036  0.203438  0.622645  0.602650 -1.053001
E  0.073979  0.691840 -0.166630  0.984064 -0.875025 -0.496758

#SÜTÜN ÇIKARMA
 - axis default = 0 , 0 satırları 1 sütünları simgeler inplace kalıcı olup olmadığını belirler

In [0]:

df.drop('C2', axis = 1 , inplace=True)

- Colum değerini index başlığı olarak atandı

In [0]:
df.set_index('C5', inplace = True)

In [0]:
print(df.index.names)

['C5']

In [0]:
print(df.columns.names)

[None]

 - c satırını verir 
 - sütün ismi belirtiyoruz

In [0]:
df.loc['C']

C1   -0.224844
C2    0.167652
C3   -0.189800
C4    0.601800
C5    0.361836
Name: C, dtype: float64

- index belirtiyoruz

In [0]:
df.iloc[0]

C1   -0.890412
C2    0.691380
C3   -1.227523
C4    0.462577
C5   -0.491417
Name: A, dtype: float64

#İSTENİLEN NOKTADAKİ VERİYİ GÖSTERME

In [12]:
df.loc['A','C5']

0.5062882519229618

#AND OR İŞLEMLERİ

In [13]:
df.loc[['A','C5'] and ['E','C5']]

/usr/local/lib/python3.6/dist-packages/ipykernel_launcher.py:1: FutureWarning:
Passing list-likes to .loc or [] with any missing label will raise
KeyError in the future, you can use .reindex() as an alternative.

See the documentation here:
https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#deprecate-loc-reindex-listlike
  """Entry point for launching an IPython kernel.

          C1       C3        C4        C5        C6
E   0.073979 -0.16663  0.984064 -0.875025 -0.496758
C5       NaN      NaN       NaN       NaN       NaN

#BİRDEN FAZLA SÜTÜN VE SATIR ÇAĞIRMAK İÇİN

In [14]:

df.loc[['A','D'],['C1','C2']]

/usr/local/lib/python3.6/dist-packages/pandas/core/indexing.py:1418: FutureWarning:
Passing list-likes to .loc or [] with any missing label will raise
KeyError in the future, you can use .reindex() as an alternative.

See the documentation here:
https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#deprecate-loc-reindex-listlike
  return self._getitem_tuple(key)

         C1  C2
A -0.675654 NaN
D  0.383685 NaN

In [15]:
df

         C1        C3        C4        C5        C6
A -0.675654  1.988181  0.821131  0.506288 -2.673562
B -0.200131  0.696673  2.715557  0.788112  0.050123
C -0.355683  0.313034  0.466823 -1.144892 -0.250105
D  0.383685  0.203438  0.622645  0.602650 -1.053001
E  0.073979 -0.166630  0.984064 -0.875025 -0.496758

#Filtreleme işlemleri
- 0.2 den büyükler true

In [16]:
df > 0.2

      C1     C3    C4     C5     C6
A  False   True  True   True  False
B  False   True  True   True  False
C  False   True  True  False  False
D   True   True  True   True  False
E  False  False  True  False  False

- Sıfır dan büyükler yazıyor diğerleri NAN YANİ FALSE

In [0]:
booleanDf= df > 0       
df[booleanDf]

         C1        C2        C3        C4        C5
A       NaN  0.691380       NaN  0.462577       NaN
B  1.459509  2.379048  0.380137       NaN       NaN
C       NaN  0.167652       NaN  0.601800  0.361836
D       NaN       NaN  0.476316  0.000822       NaN
E  1.003489       NaN       NaN       NaN       NaN

In [0]:
df[df > 0.5]

         C1        C2  C3      C4  C5
A       NaN  0.691380 NaN     NaN NaN
B  1.459509  2.379048 NaN     NaN NaN
C       NaN       NaN NaN  0.6018 NaN
D       NaN       NaN NaN     NaN NaN
E  1.003489       NaN NaN     NaN NaN

In [0]:
df['C1']>0

A    False
B     True
C    False
D    False
E     True
Name: C1, dtype: bool

In [0]:
df[(df['C1']>0) | (df['C5']>1)]

         C1        C2        C3        C4        C5
B  1.459509  2.379048  0.380137 -0.057548 -1.063365
E  1.003489 -0.336429 -2.323571 -0.395640 -0.116108

In [0]:
df

         C1        C2        C3        C4        C5         C6
A -0.890412  0.691380 -1.227523  0.462577 -0.491417  NewValue1
B  1.459509  2.379048  0.380137 -0.057548 -1.063365  NewValue2
C -0.224844  0.167652 -0.189800  0.601800  0.361836  NewValue3
D -0.574353 -0.440891  0.476316  0.000822 -0.011415  NewValue4
E  1.003489 -0.336429 -2.323571 -0.395640 -0.116108  NewValue5

#YENİ SÜTÜN OLUŞTURMA

In [0]:
df['C6'] = ['NewValue1','NewValue2','NewValue3','NewValue4','NewValue5']

#DataFramelerin Multi İndex Olarak Tanımlanması
- 2 adet index oluşturup zip fonksiyonu ile birleştirdik

In [18]:
OuterIndex = ['Group1','Group1','Group1','Group2','Group2','Group2','Group3','Group3','Group3']
InnerIndex = ['Index1','Index2','Index3','Index1','Index2','Index3','Index1','Index2','Index3']
list(zip(OuterIndex,InnerIndex))

[('Group1', 'Index1'),
 ('Group1', 'Index2'),
 ('Group1', 'Index3'),
 ('Group2', 'Index1'),
 ('Group2', 'Index2'),
 ('Group2', 'Index3'),
 ('Group3', 'Index1'),
 ('Group3', 'Index2'),
 ('Group3', 'Index3')]

In [19]:
hierarchy = list(zip(OuterIndex,InnerIndex))
hierarchy = pd.MultiIndex.from_tuples(hierarchy)
print(hierarchy)

MultiIndex([('Group1', 'Index1'),
            ('Group1', 'Index2'),
            ('Group1', 'Index3'),
            ('Group2', 'Index1'),
            ('Group2', 'Index2'),
            ('Group2', 'Index3'),
            ('Group3', 'Index1'),
            ('Group3', 'Index2'),
            ('Group3', 'Index3')],
           )

In [20]:
df =  pd.DataFrame(randn(9,3),hierarchy,columns=['C1','C2','C3'])
print(df)

                     C1        C2        C3
Group1 Index1 -0.193253  1.243209 -0.931974
       Index2 -1.287746  1.177815 -0.475188
       Index3 -0.251880  1.276781 -0.394155
Group2 Index1  0.383124  0.095019  0.484719
       Index2  1.026296 -0.541663  0.765632
       Index3 -0.775513  0.567422  0.333031
Group3 Index1 -0.647898 -0.366212 -2.179599
       Index2  1.875444  1.650499  0.710533
       Index3 -0.019086  1.070055  0.269462

In [0]:
df.loc[['Group1','Group2']]

                     C1        C2        C3
Group1 Index1 -0.637148 -1.131355 -0.065861
       Index2  0.287420  0.423742  0.114334
       Index3 -0.323098 -0.568315  0.787315
Group2 Index1  1.055753 -0.114569 -0.191438
       Index2  1.683241  0.801842 -0.993085
       Index3 -0.495235  1.855389 -0.190347

In [0]:
df.loc['Group1'].loc['Index1']['C1']

-0.6371475232849644

In [0]:
df.xs('Group1') # df.loc['Group1'] e eşit

              C1        C2        C3
Index1 -0.637148 -1.131355 -0.065861
Index2  0.287420  0.423742  0.114334
Index3 -0.323098 -0.568315  0.787315

In [0]:
df.xs('Group1').xs('Index1')

C1   -0.637148
C2   -1.131355
C3   -0.065861
Name: Index1, dtype: float64

In [0]:
#BOZUK VE KAYIP VERİLER İLE İŞLEMLER 
arr = np.array([[10,20,np.nan],[3,np.nan,np.nan],[13,np.nan,4]])
print(arr)

[[10. 20. nan]
 [ 3. nan nan]
 [13. nan  4.]]

In [0]:
df = pd.DataFrame(arr ,['Index1','Index2','Index3'],columns = ['Column1','Column2','Column3'] )
print(df)

        Column1  Column2  Column3
Index1     10.0     20.0      NaN
Index2      3.0      NaN      NaN
Index3     13.0      NaN      4.0

In [0]:
#Satırda en az bir 'NAN' var ise siler
df.dropna()

In [0]:
# INDEX satırında en az bir NAN var ise siler .
df.dropna(axis =1)

        Column1
Index1     10.0
Index2      3.0
Index3     13.0

In [0]:
#en az iki düzgün veri var ise silme 
df.dropna ( thresh=2 )

        Column1  Column2  Column3
Index1     10.0     20.0      NaN
Index3     13.0      NaN      4.0

In [0]:
#NAN YERİNE DEĞER ATAMA 
df.fillna(value = 0)

        Column1  Column2  Column3
Index1     10.0     20.0      0.0
Index2      3.0      0.0      0.0
Index3     13.0      0.0      4.0

In [0]:
#Satırları toplar 
df.sum()

Column1    26.0
Column2    20.0
Column3     4.0
dtype: float64

In [0]:
#Tüm satırların toplamını verir 
df.sum().sum()

50.0

In [0]:
df.size

9

In [0]:
#True olan değerler NAN I temsil etmektedir
df.isnull()

        Column1  Column2  Column3
Index1    False    False     True
Index2    False     True     True
Index3    False     True    False

In [0]:
#HANGİ Columda kaç adet NAN var 
df.isnull().sum()

Column1    0
Column2    2
Column3    2
dtype: int64

In [0]:
#HER COLUMDA KAÇ ADET DÜZGÜN VERİ VAR ? 
df.size - df.isnull().sum()

Column1    9
Column2    7
Column3    7
dtype: int64

In [0]:
#GROUP BY OPERASYONLARI 
data = {'Job': ['Data Mining','CEO','Lawyer','Lawyer','Data Mining','CEO'],'Labouring': ['Immanuel','Jeff','Olivia','Maria','Walker','Obi-Wan'], 'Salary': [4500,30000,6000,5250,5000,35000]}

In [0]:
df= pd.DataFrame(data)
print(df)

           Job Labouring  Salary
0  Data Mining  Immanuel    4500
1          CEO      Jeff   30000
2       Lawyer    Olivia    6000
3       Lawyer     Maria    5250
4  Data Mining    Walker    5000
5          CEO   Obi-Wan   35000

In [0]:
#SALARY ÖZELLİĞİNE GÖRE GRUPLANDIRMA 
SalaryGroupBy= df.groupby('Salary')

In [0]:
SalaryGroupBy.sum()

                Job Labouring
Salary
4500    Data Mining  Immanuel
5000    Data Mining    Walker
5250         Lawyer     Maria
6000         Lawyer    Olivia
30000           CEO      Jeff
35000           CEO   Obi-Wan

In [0]:
#MESLEĞİ CEO OLANLARIN TOPLAMI 
df.groupby('Job').sum().loc['CEO']

Salary    65000
Name: CEO, dtype: int64

In [0]:
df.groupby('Job').count()

             Labouring  Salary
Job
CEO                  2       2
Data Mining          2       2
Lawyer               2       2

In [0]:
#SALARY E GÖRE GRUPTLANDIRIP EN DÜŞÜK  MAAŞI BASTIRDIK
df.groupby('Job').min()['Salary']

Job
CEO            30000
Data Mining     4500
Lawyer          5250
Name: Salary, dtype: int64

In [0]:
#EN DÜŞÜK MAAŞLI AVUKATIN MAAŞINI BASTIRDIK
df.groupby('Job').min()['Salary']['Lawyer']

5250